### Forest mainnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.mainnet.data.digitalocean_project.forest_project: Reading...
module.mainnet.data.digitalocean_ssh_keys.keys: Reading...
module.mainnet.digitalocean_volume.forest_volume[0]: Refreshing state... [id=a624275d-0b6f-11ee-b0a7-0a58ac14d15f]
module.mainnet.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4003270040538543685]
module.mainnet.digitalocean_droplet.forest: Refreshing state... [id=361846960]
module.mainnet.digitalocean_volume_attachment.forest_volume[0]: Refreshing state... [id=361846960-a624275d-0b6f-11ee-b0a7-0a58ac14d15f-20230622134736672100000001]
module.mainnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=c29d1231-7259-45b4-8942-40a083cf16aa]
module.mainnet.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.mainnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.mainnet.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-06-22T13:46:13Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "361846960" -> (known after apply)
      ~ ipv4_address         = "164.92.192.158" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "forest"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "mainnet",
        ]
      ~ urn                  = "do:droplet:361846960" -> (known after apply)
      ~ user_data            = "84c0bd413b9a752d95dbd9f5ee41a8edd533e479" -> "6adf705b4a8a46ab82a522385fb07916d33d88d8" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [
          - "a624275d-0b6f-11ee-b0a7-0a58ac14d15f",
        ] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.mainnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 361846960,
        ] -> (known after apply)
        id              = "c29d1231-7259-45b4-8942-40a083cf16aa"
        name            = "forest-mainnet-fw"
        tags            = [
            "mainnet",
        ]
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.mainnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:361846960",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.mainnet.digitalocean_volume_attachment.forest_volume[0] must be replaced
-/+ resource "digitalocean_volume_attachment" "forest_volume" {
      ~ droplet_id = 361846960 # forces replacement -> (known after apply) # forces replacement
      ~ id         = "361846960-a624275d-0b6f-11ee-b0a7-0a58ac14d15f-20230622134736672100000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>